Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/death/after_a_death/index.html.txt.tmx
Source language: en
Languages: ga

source: Find how to register a death and how to obtain a death certificate
ga: Cur síos ar an teastas báis

source: Information on standards in the Irish funeral industry, types of funeral and useful contacts
ga: Cur síos ar sochraidí

source: Maintenance, management and how to purchase a burial plot
ga: Leagann an cháipéis seo síos na coinníollacha a rialaíonn reiligí

source: Cremation is an alternative to burial, when someone dies
ga: Nuair a fhaigheann duine bás, is féidir le duine créamadh a roghnú in ionad adhlactha

source: In recent years cremation has become increasingly popular
ga: Le linn na blianta beaga anuas, tá créamadh á roghnú ag níos mó daoine in Éirinn

source: Bringing a body to Ireland for burial or cremation
ga: Corp a thabhairt ar ais go hÉirinn chun é a adhlacadh nó a chréamadh

source: When someone dies abroad it is often difficult to know what to do
ga: Nuair a fhaigheann duine bás thar lear is minic is deacair dul i ngreim le ba cheart a dhéanamh

source: Find out here the steps to take to bring a body home for burial or cremation
ga: Léirítear na céimeanna anseo i dtaca le corp a thabhairt abhaile chun é a adhlacadh nó a chréamadh bás agus ag fáil bháis sochraidí

source: Sending a body from Ireland for burial or cremation abroad
ga: Seoladh corp as Éirinn le haghaidh adhlactha nó créamtha thar lear

source: Before the body of a deceased person can be sent out of Ireland, certain formalities must be followed. Find out more
ga: Sula seoltar marbhán as Éirinn tá foirmiúlachtaí áirithe a chaithfear a leanúint

source: Most Read in "Death and Bereavement"
ga: Ábhar is mó éilimh i "Bás agus Méala"

source: Dealing with the deceased's estate
ga: Deileáil le hEastát an Mhairbh
